<!DOCTYPE html>
<html lang="en">

<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Document</title>
	<link rel="stylesheet" href="style.css">
</head>

<body>
	<div class="wrapper">
		<span>&#60; </span><a href="ege.html">Вернуться к списку задач</a>
		<h1>Решение 17 задач Python</h1>

		<div class="exercise">
			<p><span class="number">12249</span> В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от —100 000 до 100 000 включительно. Определите количество троек элементов последовательности, в которых хотя бы один из трёх элементов оканчивается на 3, а сумма элементов тройки не больше максимального элемента последовательности, являющегося пятизначным числом, которое оканчивается на 3. В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.
			<a class="download" href="17/17_10719.txt" download>17_12249.txt</a></p>
			<pre class="blur">
a = [int(x) for x in open('17_12249.txt')]
m = max(x for x in a if 10000 &#60;= abs(x) &#60;= 99999 and abs(x)%10 == 3)
ans=[]
for i in range(len(a) - 2):
    x,y,z = a[i],a[i+1],a[i+2]
    if (abs(x)%10 == 3 or abs(y)%10 == 3 or abs(z)%10 == 3) and \
       (x+y+z) &#60;= m:
        ans.append(x+y+z)
print(len(ans), max(ans))</pre>
		</div>


		<div class="exercise">
			<p>8954 В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения от 1 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число кратно 7, а сумма элементов пары кратна максимальному элементу последовательности, оканчивающемуся на 0F в шестнадцатеричной системе счисления. В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.</p>
			<pre class="blur">
a = [int(x) for x in open('17_8954.txt')]
m = max(x for x in a if x % 0x100 == 0x0F)
ans = []
for i in range(len(a) - 1):
    x,y=a[i],a[i+1]
    if (x%7==0) + (y%7==0) == 1 and \
       (x+y) % m == 0:
        ans.append(x+y)
print(len(ans), max(ans))</pre>
		</div>


		<div class="exercise">
			<p>2238 В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. Определите количество троек, в которых хотя бы два из трёх элементов больше, чем среднее арифметическое всех чисел в файле. В ответе запишите два числа: сначала количество найденных троек, а затем – максимальную сумму элементов таких троек. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.</p>
			<pre class="blur">
a = [int(x) for x in open('17_2238.txt')]
avg = sum(a)/len(a)
ans = []
for i in range(len(a)-2):
    x,y,z = a[i],a[i+1],a[i+2]
    if (x>avg) + (y>avg) + (z>avg) >= 2:
        ans.append(x+y+z)
print(len(ans), max(ans))</pre>
		</div>



		<div class="exercise">
			<p>не более 1 элемента</p>
			<pre class="blur">
() + () &#60;= 1</pre>
		</div>


		<div class="exercise">
			<p>11703 число оканчивается на 18</p>
			<pre class="blur">
x % 100 == 18</pre>
		</div>

	</div>
	</div>
	</div>
</body></html>
