<!DOCTYPE html>
<html lang="en">

<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>ЕГЭ информатика</title>
	<link rel="icon" href="img/favicon.ico">
	<link rel="stylesheet" href="style.css">
</head>

<body>
	<div class="wrapper">
		<span>&#60; </span><a href="index.html">Вернуться к списку задач</a>
		<h1>Решение 19-20-21 задач</h1>

		<h2>(1 тип) 1 куча камней, победа</h2>
		<p><span class="number">12251</span></p>

		<p>19. Первый ход делает Петя. +3 или *5. Победа при >=301
		</p>
		<p>MIN S когда Ваня выигрывает первым при любом ходе Пети</p>

		<p>20.
			Найти 2 минимальных.
			Два условия:
			– Петя не может выиграть за один ход;
			– Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
			Найденные значения запишите в ответе в порядке возрастания. </p>

		<p>21.
			Минимальное значение S.
			Два условия:
			– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
			– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
			Если найдено несколько значений S, в ответе запишите минимальное из них</p>

		<pre>
58
12 55
52
def f(s, m):
 if s >= 301: return m%2 == 0
 if m == 0: return 0
 h = [f(s+3, m-1), f(s*5, m-1)]
 return any(h) if (m-1)%2 == 0 else all(h)

print([s for s in range(1,301) if f(s,2)])
print([s for s in range(1, 301) if f(s, 3) > f(s,1)])
print([s for s in range(1,301) if f(s,4)>f(s,2)])</pre>


		<h2>(2 тип) 1 куча камней, проигрыш</h2>

		<p>19. Первый ход делает Петя. +2 или *3. Игра завершится, когда будет не менее 45, Если не более 112 то последний ход победный
		</p>
		<p>MIN s когда Ваня выигрывает первым при любом ходе Пети</p>

		<p>20.
			Сколько значений?
			Два условия:
			– Петя не может выиграть за один ход;
			– Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
			Найденные значения запишите в ответе в порядке возрастания. </p>

		<p>21.
			Найти 2 значения.
			Два условия:
			– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
			– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
			Если найдено несколько значений S, в ответе запишите минимальное из них</p>

		<pre>
def f(s, m):
 if 45 &#60;= s &#60;= 112: return m%2 == 0
 if s > 112: return m%2!=0
 if m == 0: return 0
 h = [f(s+2, m-1), f(s*3, m-1)]
 return any(h) if (m-1)%2 == 0 else all(h)

print([s for s in range(1, 45) if f(s,2)])
print([s for s in range(1, 45) if not f(s, 1) and f(s, 3)])
print([s for s in range(1, 45) if  not f(s, 2) and f(s, 4)])</pre>


		<h2>(3 тип) 2 кучи камней, проигрыш</h2>

		<p>19. Первый ход делает Петя. +1 или *3. Игра завершится, когда в двух кучах будет не менее 45. В 1й куче 4 камня, во второй 1 &#60;= s &#60;= 40
		</p>
		<p>Ваня выйграл после неудачного хода, найти min S </p>

		<p>20.
			2 значения.
			Два условия:
			– Петя не может выиграть за один ход;
			– Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
			Найденные значения запишите в ответе в порядке возрастания. </p>

		<p>21.
			Найти S.
			Два условия:
			– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
			– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
			Если найдено несколько значений S, в ответе запишите минимальное из них</p>

		<p>19. all меняем на any в коде, чтобы найти хотябы 1 победу</p>
		<pre>
5
def f(s, b, m):
 if s + b >= 45: return m%2 == 0
 if m == 0: return 0
 h = [f(s+1, b, m-1), f(s*3,b,m-1), f(s, b+1,m-1), f(s, b*3, m-1)]
 return any(h) if (m-1)%2 == 0 else any(h)
 
print([s for s in range(1, 41) if f(4, s, 2)])</pre>

		<p>20. 21. any меняем на all</p>
		<pre>
8, 13
12
def f(s, b, m):
 if s + b >= 45: return m%2 == 0
 if m == 0: return 0
 h = [f(s+1, b, m-1), f(s*3,b,m-1), f(s, b+1,m-1), f(s, b*3, m-1)]
 return any(h) if (m-1)%2 == 0 else all(h)
 
print([s for s in range(1, 41) if not f(4, s, 1) and f(4,s,3)])
print([s for s in range(1, 41) if not f(4, s, 2) and f(4,s,4)])</pre>


	</div>
</body>

</html>
