<!DOCTYPE html>
<html lang="en">

<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Document</title>
	<link rel="stylesheet" href="style.css">
</head>

<body>
	<div class="wrapper">
		<span>&#60; </span><a href="index.html">Вернуться к списку задач</a>
		<h1>Решение 24 задач Python</h1>
		<p>2419 В текстовом файле находится цепочка из символов латинского алфавита A, B, C длиной не более 10<sup>6</sup> символов. Найдите длину самой длинной подцепочки, состоящей из символов C</p>
		<pre>
s = open('24_2419.txt').readline()
s = s.replace('A', ' ').replace('B', ' ')
s = s.split()
print(max(len(c) for c in s))</pre>

		<p>9791 Текстовый файл состоит из символов, обозначающих заглавные буквы латинского алфавита и цифры от 1 до 9 включительно. Определите в прилагаемом файле максимальное количество идущих подряд символов, которые могут представлять запись числа в шестнадцатеричной системе счисления.

			Для выполнения этого задания следует написать программу.

			Примечание. Цифры, числовое значение которых превышает 9, обозначены латинскими буквами, начиная с буквы А.</p>
		<pre>
s = open('24_9791.txt').readline()
for c in 'QWRTYUIOPSGHJKLZXVNM':
    s = s.replace(c, ' ')
print(max(len(c) for c in s.split()))</pre>

		<p>1874 Текстовый файл состоит не более чем из 10<sup>6</sup> символов и содержит только заглавные буквы латинского алфавита (A..Z). Определите максимальное количество идущих подряд символов, среди которых нет сочетания символов QW.</p>
		<pre>
s = open('24_1874.txt').readline()
s = s.replace('QW', 'Q W')
print(max(len(c) for c in s.split()))
</pre>
	</div>
</body></html>
