<!DOCTYPE html>
<html lang="en">

<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Document</title>
	<link rel="stylesheet" href="style.css">
</head>

<body>
	<div class="wrapper">
		<span>&#60; </span><a href="index.html">Вернуться к списку задач</a>
		<h1>Решение 24 задач Python</h1>
		<p>2419 В текстовом файле находится цепочка из символов латинского алфавита A, B, C длиной не более 10<sup>6</sup> символов. Найдите длину самой длинной подцепочки, состоящей из символов C</p>
		<pre>
s = open('24_2419.txt').readline()
s = s.replace('A', ' ').replace('B', ' ')
print(max(len(c) for c in s.split()))</pre>

		<p>9791 Текстовый файл состоит из символов, обозначающих заглавные буквы латинского алфавита и цифры от 1 до 9 включительно. Определите в прилагаемом файле максимальное количество идущих подряд символов, которые могут представлять запись числа в шестнадцатеричной системе счисления.

			Для выполнения этого задания следует написать программу.

			Примечание. Цифры, числовое значение которых превышает 9, обозначены латинскими буквами, начиная с буквы А.</p>
		<pre>
s = open('24_9791.txt').readline()
for c in 'QWRTYUIOPSGHJKLZXVNM':
    s = s.replace(c, ' ')
print(max(len(c) for c in s.split()))</pre>

		<p>1874 Текстовый файл состоит не более чем из 10<sup>6</sup> символов и содержит только заглавные буквы латинского алфавита (A..Z). Определите максимальное количество идущих подряд символов, среди которых нет сочетания символов QW.</p>
		<pre>
s = open('24_1874.txt').readline()
s = s.replace('QW', 'Q W')
print(max(len(c) for c in s.split()))
</pre>

		<p>Текстовый файл состоит из символов латинского алфавита (A..Z). Определите максимальное количество идущих подряд символов, среди которых нет сочетания символов KEGE.</p>
		<pre>
s = open('24.txt').readline()
s = s.replace('KEGE', 'KEG EGE')
print(max(len(c) for c in s.split()))
</pre>

		<p>Текстовый файл состоит из символов латинского алфавита (A..Z). Определите максимальное количество идущих подряд символов, среди которых нет сочетания символов PPP.</p>
		<pre>
s = open('24.txt').readline()
while 'PPP' in s: s = s.replace('PPP', 'PP PP')
print(max(len(c) for c in s.split()))
</pre>

		<p>Текстовый файл состоит из X Y Z. Определите максимальное количество идущих подряд пар символов ZX или ZY.</p>
		<pre>
s = open('24.txt').readline()
s = s.replace('ZX', '*').replace('ZY', '*')
s = s.replace('X', ' ').replace('Y', ' ').replace('Z', ' ')
print(max(len(c) for c in s.split()))
</pre>

		<p>Текстовый файл состоит из A B C 1 2 3. Определите максимальное количество идущих подряд троек буква + цифра + цифра</p>
		<pre>
s = open('24.txt').readline()
s = s.replace('B', 'A').replace('C', 'A').replace('2', '1').replace('3', '1')
s = s.replace('A11', '*').replace('A', ' ').replace('1', ' ')
print(max(len(c) for c in s.split()))
</pre>

		<p>Текстовый файл состоит из A B C 8 9. Определите максимальное количество идущих подряд символов, среди которых ни одна буква не стоит рядом с буквой а цифра с цифрой</p>
		<pre>
s = open('24.txt').readline()
s = s.replace('B', 'A').replace('C', 'A').replace('9', '8')
while 'AA' in s: s = s.replace('AA', 'A A')
while '88' in s: s = s.replace('88', '8 8')
print(max(len(c) for c in s.split()))
</pre>

		<p>Текстовый файл состоит из A B C D E. Определите максимальное количество идущих подряд символов, среди которых символ А встречается не более 3 раз</p>
		<pre>
s = open('24.txt').readline()
s = s.split('A')
m=0
for i in range(len(s) - 3):
 c = s[i] + 'A' + s[i+1] + 'A' + s[i+2] + 'A'+ s[i+3]
 m = max(m, len(c))
print(m)
</pre>

		<p>Текстовый файл состоит из A B C D E. Определите МИНИМАЛЬНОЕ количество идущих подряд символов, среди которых символ А встречается не более 3 раз</p>
		<pre>
s = open('24.txt').readline()
s = s.split('A')
m=0
for i in range(len(s) - 3):
 c = 'A' + s[i+1] + 'A' + s[i+2] + 'A'
 m = max(m, len(c))
print(m)
</pre>

		<p>Текстовый файл состоит из A B C D E. Определите МИНИМАЛЬНОЕ количество идущих подряд символов, среди которых символ А встречается 35 раз</p>
		<pre>
s = open('24.txt').readline()
s = s.split('A')
m=10000
for i in range(len(s) - 35):
 c = A.join(s[i:i+36])
 m = min(m, len(c) - len(s[i]) - len(s[i+35]))
print(m)
</pre>
	</div>
</body></html>
