<!DOCTYPE html>
<html lang="en">

<head>
	<meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Document</title>
	<link rel="stylesheet" href="style.css">
</head>

<body>
	<div class="wrapper">
		<span>&#60; </span><a href="index.html">Вернуться к списку задач</a>
		<h1>Решение 8 задач Python</h1>
		
		
		<div class="exercise">
			<p>Основные ошибки</p>
			<pre class="blur">
1) при работе с числами забыть про s[0]!=0 или s[0]!='0'
2) </pre>
		</div>

		<div class="exercise">
			<p><span class="number">12240</span> Сколько существует девятеричных пятизначных чисел, содержащих в своей записи ровно одну цифру 5, в которых никакие две одинаковые цифры не стоят рядом?</p>
			<pre class="blur">
from itertools import *
k=0
for s in product('012345678', repeat=5):
    s = ''.join(s)
    if s.count('5') == 1 and s[0]!='0' and \
       all(s[i]!= s[i+1] for i in range(4)):
            k+=1
print(k)</pre>
		</div>


		<div class="exercise">
			<p><span class="number">11657</span>Сколько существует восьмеричных шестизначных чисел, не содержащих в своей записи цифру 3, в которых все цифры различны и хотя бы две чётные стоят рядом?</p>
			<pre class="blur">
from itertools import *
k=0
for s in permutations(range(8), r=6):
    if s[0]!=0 and 3 not in s and \
       any(s[i]%2==0 and s[i+1]%2==0 for i in range(5)):
        k+=1
print(k)
</pre>
		</div>


		<div class="exercise">
			<p>11300 последнее слово с нечётным номером</p>
			<pre class="blur">
n % 2 != 0</pre>
		</div>


		<div class="exercise">
			<p>10090 никакие две чётные или две нечётные цифры не стоят рядом</p>
			<pre class="blur">
if '00' not in s and '33' not in s</pre>
		</div>


		<div class="exercise">
			<p>9695 пятибуквенные слова из букв слова УДАЧ. Первая буква может быть только гласной</p>
			<pre class="blur">
if s[0] in 'АУ'</pre>
		</div>


		<div class="exercise">
			<p>9155 Сколько слов, оканчивающихся на Ь, запишет Катя, если заполнит список до 387 позиции</p>
			<pre class="blur">
from itertools import *
k = 0
c = 0
m = 0
for s in product('ЬРПЛЕА', repeat = 4):
    k+=1
    if s[-1] == 'Ь':
        c += 1
    if k == 387:
        m=c
print(m) 
   </pre>
			<pre class="blur">
from itertools import *
k = 0
for i, s in enumerate(product('ЬРПЛЕА', repeat = 4)):
    if s[-1] == 'Ь':
        k += 1
    if i == 387:
        break
print(k) 
   </pre>
		</div>


		<div class="exercise">
			<p>7810 Игорь использует 6-буквенные слова, в которых есть только буквы М, А, С, Л, О. причём в кодовом слове должна встречаться ровно одна гласная</p>
			<pre class="blur">
s.count('А') + s.count('О') == 1</pre>
		</div>


		<div class="exercise">
			<p>7673 Какое количество слов находятся между словами ЕГЭ2023 и 2023ЕГЭ</p>
			<pre class="blur">
from itertools import *
k = 0
for s in product('ГЕЭ023', repeat = 7):
    s = ''.join(s)
    k+=1
    if s == 'ЕГЭ2023':
        print(k)
    if s == '2023ЕГЭ':
        print(k)
print(216255-50250)</pre>
		</div>


		<div class="exercise">
			<p>6892 никакая нечётная цифра не стоит рядом с цифрой 2</p>
			<pre class="blur">
all(c not in s for c in ['12', '32', '21', '23'])</pre>
		</div>


		<div class="exercise">
			<p>6496 Гатс составляет слово из букв Б, Е, Р, С, К. Слово может иметь длину от 5 до 7 букв. Сколько слов может составить Гатс?</p>
			<pre class="blur">
5*5 + 6*6 + 7*7</pre>
		</div>


		<div class="exercise">
			<p>4258 Словом считается любая допустимая последовательность букв, не обязательно осмысленная</p>
			<pre class="blur">
permutations</pre>
		</div>


		<div class="exercise">
			<p>4099 Под каким номером в списке идёт последнее слово, в котором все буквы различны?</p>
			<pre class="blur">
if len(set(s)) == 4:</pre>
		</div>


		<div class="exercise">
			<p>2798 Код должен состоять из 8 букв, и каждая буква в нём должна встречаться столько же раз, сколько в имени Светлана</p>
			<pre class="blur">
permutations
print(k/2)</pre>
		</div>


		<div class="exercise">
			<p>2670 на первом и последнем месте в слове могут стоять только согласные буквы</p>
			<pre class="blur">
5*8*8*8*5</pre>
		</div>


		<div class="exercise">
			<p>четные и нечетные чередуются</p>
			<pre class="blur">
(s[i] + s[i+1])%2 != 0</pre>
		</div>

	</div>


</body></html>
