<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Document</title>
    <link rel="stylesheet" href="style.css">
</head>

<body>
    <div class="wrapper">
        <span>&#60; </span><a href="ege.html">Вернуться к списку задач</a>
        <h1>Решение 9 задач Python</h1>
        <div class="exercise">


            <div class="exercise">
                <p><span class="number">12463</span> Откройте файл электронной таблицы, содержащей в каждой строке девять натуральных чисел. Определите количество строк таблицы, для чисел которых выполнены оба условия:

                <p>- в строке есть одно число, которое повторяется четыре раза, есть другое число, которое повторяется дважды, остальные три числа различны;</p>

                <p>- среднее арифметическое трёх неповторяющихся чисел строки не меньше наибольшего из повторяющихся в строке чисел.
                    <a class="download" href="9/9_12463.txt" download>9_12463.txt</a>
                </p>
                <pre class="blur">
k=0
for s in open('9_12463.txt'):
    a = sorted(map(int, s.split()))
    a4 = [int(x) for x in a if a.count(x)==4]
    a2 = [x for x in a if a.count(x) == 2]
    a1 = [x for x in a if a.count(x) == 1]
    if len(a4)==4 and len(a2) == 2 and len(a1) == 3 and \
       sum(a1)/3 >= max(a4[0], a2[0]):
        k+=1
print(k)</pre>
            </div>


            <div class="exercise">
                <p><span class="number">9156</span> Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:</p>
                <p>– сумма максимального и минимального значений кратна 3;</p>
                <p>– четыре числа можно разбить на две пары так, чтобы разность значений в парах была одинаковой.</p>
                <p>В ответе запишите только число.
                    <a class="download" href="9/9_9156.txt" download>9_9156.txt</a>
                </p>

                <pre class="blur">
k=0
for s in open('9_9156.txt'):
    a = sorted(map(int, s.split()))
    if (a[0]+a[3])%3==0 and \
       a[0] + a[3] == a[1] + a[2]:
        k+=1
print(k)</pre>
            </div>


            <div class="exercise">
                <p>8667 все числа различны</p>
                <pre class="blur">
a1 = [x for x in a if a.count(x)==1]
if len(a1)==6</pre>
            </div>


            <div class="exercise">
                <p>7697 все числа в строке равны 18</p>
                <pre class="blur">
if sum(a)*5 == 18</pre>
            </div>


            <div class="exercise">
                <p>6999 в строке ровно три числа кратных трем</p>
                <pre class="blur">
a3 = [x for x in if a x % 3]
if len(a3) == 3</pre>
            </div>


            <div class="exercise">
                <p>5664 Решить!</p>
                <pre class="blur">
</pre>
            </div>


            <div class="exercise">
                <p>5235 Решить</p>
                <pre class="blur">
</pre>
            </div>


            <div class="exercise">
                <p>4634 Решить</p>
                <pre class="blur">
</pre>
            </div>


            <div class="exercise">
                <p>10910 минимальное число не повторяется</p>
                <pre class="blur">
if a.count(a[0]) == 1</pre>
            </div>


            <div class="exercise">
                <p>сумма во всех возможных парах четная</p>
                <pre class="blur">
a2 = [x for x in a if x%2==0]
a1 = [x for x in a if x%2!=0]
if len(a2) == 6 or len(a1) == 6</pre>
            </div>

            <div class="exercise">
                <p>10026 (Средний) есть повторяющиеся числа</p>
                <pre class="blur">
a2 = [x for x in a if a.count(x) > 1]
if len(a2) > 0</pre>
            </div>

        </div>


</body></html>
