<!DOCTYPE html>
<html lang="en">

<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Python практика</title>
	<link rel="icon" href="img/favicon.ico">
	<link rel="stylesheet" href="style.css">
</head>

<body>
	<div class="wrapper">
		<span>&#60; </span><a href="index.html">Вернуться на главную</a>

		<h1>Углубленный курс по программированию на Python</h1>


		<div class="border">
			<h4>Ученики увлеклись шифрованием и шифруют свои имена и фамилии, расставляя в них буквы в алфавитном порядке (отдельно в имени, отдельно в фамилии), а потом записывают их заглавными буквами, каждый ученик — в новой строке.
Например, имя Соня Сонина превращается в НОСЯ АИННОС.
Учеников звали Лера Иванова, Вася Сидоров и Катя Антонова. Выведите, что у них получилось.</h4>
			<div class="flex-pre">
				<pre>
АЕЛР ААВВИНО
АВСЯ ВДИООРС
АКТЯ ААВННООТ
</pre>
				<pre class="blur2">
a = 'Лера Иванова, Вася Сидоров, Катя Антонова'
# строку возведем в верхний регистр
# и разобъем в массив по разделителю 
b = a.upper().split(', ')
#['ЛЕРА ИВАНОВА', 'ВАСЯ СИДОРОВ', 'КАТЯ АНТОНОВА']
for i in b:
    # пройдемся по каждому элементу
    # сделаем каждый элемент отдельным массивом
    # ЛЕРА ИВАНОВА -> ['ЛЕРА', 'ИВАНОВА']
    c = i.split(' ')
    # создадим пустой массив
    ans = []
    for i in c:
        # отсортируем буквы каждого слова
        # по возрастанию и склеим слова в строку
        ans.append(''.join(sorted(i)))
    # выведем каждую строку
    print(' '.join(ans))
</pre>
			</div>
		</div>

		<div class="border">
			<h4>Аня учит порядок цветов радуги. Чтобы дать ей потренироваться, Вася собирается расставить цвета в алфавитном порядке и предложить Ане восстановить последовательность.
Напишите программу, выводящую в столбик все цвета радуги в алфавитном порядке и с маленьких букв.</h4>
			<div class="flex-pre">
				<pre>
голубой
желтый
зеленый
красный
оранжевый
синий
фиолетовый
</pre>
				<pre class="blur2">
a = ['красный', 'оранжевый', 
 'желтый', 'зеленый', 
 'голубой', 'синий', 'фиолетовый']
# печать каждого нового символа с новой строки
print(*sorted(a), sep="\n")
</pre>
			</div>
		</div>

		<div class="border">
			<h4>Вася подсмотрел заготовки наших задач и решил, что такое он и сам умеет. Он напечатал в первой, третьей и пятой строках их названия: например, в первой написано 'первая строка'. Напишите такую программу.</h4>
			<div class="flex-pre">
				<pre>
первая строка

третья строка

пятая строка
</pre>
				<pre class="blur2">
a = ['первая строка', 
 '', 'третья строка', 
 '', 'пятая строка',]
# печать каждого нового символа с новой строки
print(*a, sep="\n")
</pre>
			</div>
		</div>

		<div class="border">
			<h4>Лера записывает нули и единицы в табличке 5х5.
Она хочет расставить цифры так, чтобы сумма цифр в первой строке была равна 1, во второй — 2, и так далее до пятой, где сумма равна 5; также нужно, чтобы сумма цифр в первом столбце была равна 1, во втором — 2, ... в пятом — 5.
Помогите Лере расставить цифры и выведите готовую таблицу (цифры в строке пишутся через пробелы, никаких символов кроме 0 и 1 нет).</h4>
			<div class="flex-pre">
				<pre>
0 0 0 0 1
0 0 0 1 1
0 0 1 1 1
0 1 1 1 1
1 1 1 1 1
</pre>
				<pre class="blur2">
print('0 0 0 0 1')
print('0 0 0 1 1')
print('0 0 1 1 1')
print('0 1 1 1 1')
print('1 1 1 1 1')
</pre>
			</div>
		</div>

		<div class="border">
			<h4>Редактор школьной газеты Костя серьезно относится к работе газеты: каждую неделю он подсчитывает, сколько заданий нужно сделать его подопечному Васе и сколько тот уже сделал.
Костя даже написал программу, которая бы печатала текст с количеством задач, но, запустив её вечером понедельника, случайно удалил пару строк.
Посмотрите на результат запуска и помогите Косте восстановить программу, не меняя готовых строк.</h4>
			<div class="flex-pre">
				<pre>
Заготовка кода
all_tasks = 99
done_tasks = 7

print(goodbye)
Вывод

Из 99 дел сделано только 7
До встречи!
</pre>
				<pre class="blur2">
all_tasks = 99
done_tasks = 7
print(f'Из {all_tasks} 
  дел сделано только {done_tasks}')
goodbye = 'До встречи!'
print(goodbye)
</pre>
			</div>
		</div>

		<div class="border">
			<h4>Оля и Аня играют в игру: они записали троих персонажей, три действия и три описания, и теперь расставляют их в разном порядке, получая смешные сочетания. Придумайте персонажей/действия/описания, выведите их в столбик, а затем выведите 4 разных сочетания вида «персонаж действие описание».</h4>
			<div class="flex-pre">
				<pre>
дружелюбный динозавр Вася
мальчик Вовочка
директор школы Андрей Иванович
залез на крышу
получил двойку
объел клумбу
в красивой шляпе
утром понедельника
тайком от мамы
дружелюбный динозавр 
  Вася получил двойку тайком от мамы
директор школы Андрей 
  Иванович объел клумбу тайком от мамы
дружелюбный динозавр 
  Вася залез на крышу утром понедельника
мальчик Вовочка залез 
  на крышу в красивой шляпе
</pre>
				<pre class="blur2">
a = ['дружелюбный динозавр Вася',
'мальчик Вовочка',
'директор школы Андрей Иванович']
b = ['залез на крышу',
'получил двойку',
'объел клумбу']
c = ['в красивой шляпе',
'утром понедельника',
'тайком от мамы']

print(*(a), sep="\n")
print(*(b), sep="\n")
print(*(c), sep="\n")

for i in range(3):
    print(a[i]+ ' '+ b[i] +' '+ c[i])
print(a[0]+ ' '+ b[1] +' '+ c[2])
</pre>
			</div>
		</div>

		<div class="border">
			<h4>Вася принимает сигналы из космоса на радиоприёмник. Он уже успел записать такую последовательность символов:
|-|--|---|----|
Догадайтесь, какими должны быть следующие 12 символов и напишите программу, которая бы печатала дополненную последовательность.</h4>
			<div class="flex-pre">
				<pre>
|-|--|---|----|-----|------
</pre>
				<pre class="blur2">
a = '|-|--|---|----|'
#print(len(a)) 15
#print(15+12) 27
b = '|'
c = '-'
# |1|2|3|4|...
# b1*-b2*-...
s = ''
for i in range(1,7):
    s = s + (b + i*c)
#print(s) |-|--|---|----|-----|------
#print(len(s)) 27
print(s)
</pre>
			</div>
		</div>

		<div class="border">
			<h4>Вася решил поучаствовать в школьной лотерее. Для этого ему нужно выбрать простое число до 50, но он их совсем не помнит.
Выведите все простые числа до 50 через пробел. Переходите на новую строку при начале нового десятка (то есть, простые числа до 10 должны быть на первой строчке, а от 10 до 20 — на второй, и т.д.).</h4>
			<div class="flex-pre">
				<pre>
2 3 5 7
11 13 17 19
23 29
31 37
41 43 47
</pre>
				<pre class="blur2">
ans = []
#создаем пустой массив
for i in range(2,51):
    #цикл от 1 до 50
    k = 0
    #счетчик делителей
    for j in range(2, (i // 2) + 1):
        #делится без остатка?
        if (i % j == 0):
            #крути барабан
            k = k+1
    # нет делителей?
    if (k &#60;= 0):
        #полезай в массив
        ans.append(i)

#print(ans)
#[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47]
# 5 4 2 2 3
#print(len(ans)) 16
print(*ans[:4], sep=" ")
print(*ans[4:8], sep=" ")
print(*ans[8:10], sep=" ")
print(*ans[10:12], sep=" ")
print(*ans[12:15], sep=" ")
</pre>
			</div>
		</div>

		<div class="border">
			<h4></h4>
			<div class="flex-pre">
				<pre>

</pre>
				<pre class="blur2">

</pre>
			</div>
		</div>

		<div class="border">
			<h4></h4>
			<div class="flex-pre">
				<pre>

</pre>
				<pre class="blur2">

</pre>
			</div>
		</div>

		<div class="border">
			<h4></h4>
			<div class="flex-pre">
				<pre>

</pre>
				<pre class="blur2">

</pre>
			</div>
		</div>

		<div class="border">
			<h4></h4>
			<div class="flex-pre">
				<pre>

</pre>
				<pre class="blur2">

</pre>
			</div>
		</div>

		<div class="border">
			<h4></h4>
			<div class="flex-pre">
				<pre>

</pre>
				<pre class="blur2">

</pre>
			</div>
		</div>

		<div class="border">
			<h4></h4>
			<div class="flex-pre">
				<pre>

</pre>
				<pre class="blur2">

</pre>
			</div>
		</div>

		<div class="border">
			<h4></h4>
			<div class="flex-pre">
				<pre>

</pre>
				<pre class="blur2">

</pre>
			</div>
		</div>



	</div>
</body></html>
